particle-iot/device-os/hal/src/rtl872x/exflash_hal.cpp
#define DW_BITS_SET_VAL(__datum, __bfws, __val, bit_num)                    \
    ((__datum) = ((uint32_t) (__datum) &                                    \
                ~DW_BIT_MASK_WIDTH(__bfws, bit_num)) |                      \
    ((__val << (__bfws)) & DW_BIT_MASK_WIDTH(__bfws, bit_num)))

#define CMD_ADDR_FORMAT(cmd, addr) (((cmd) & 0x000000ff) |                  \
                ((addr & 0x000000ff) << 24) |                               \
                ((addr & 0x0000ff00) << 8) |                                \
                ((addr & 0x00ff0000) >> 8))

#define DW_BIT_GET_UNSHIFTED(__datum, __bfws)                               \
    ((uint32_t) ((__datum) & DW_BIT_MASK(__bfws)))

enum spi_flash_byte_num {
    DATA_BYTE = 0,
    DATA_HALF = 1,
    DATA_WORD = 2
};

__attribute__((section(".ram.text"), noinline))
static uint32_t spi_flash_getdr(uint32_t dr_num, enum spi_flash_byte_num byte_num) {
    uint32_t rd_data;
    if (dr_num > 31) {
        return 0;
    } else if (byte_num == DATA_BYTE) {
        rd_data = SPIC->dr[dr_num].byte & 0x000000ff;
    } else if (byte_num == DATA_HALF) {
        rd_data = SPIC->dr[dr_num].half & 0x0000ffff;
    } else if (byte_num == DATA_WORD) {
        rd_data = SPIC->dr[dr_num].word;
    } else {
        return 0;
    }
    return rd_data;
}

__attribute__((section(".ram.text"), noinline))
static void gd25_gd25_spi_flash_getdr() {
    while (1) {
        if (DW_BIT_GET_UNSHIFTED(SPIC->sr, bfoSPI_FLASH_SR_TXE)) {
            break;
        }
        if ((!DW_BIT_GET_UNSHIFTED(SPIC->sr, bfoSPI_FLASH_SR_BUSY))) {
            break;
        }
    }
}

__attribute__((section(".ram.text"), noinline))
static void gd25_enable_cs_read(uint32_t len) {
    /* set receive data length */
    if (len <= 0x00010000) {
        SPIC->ctrlr1 = len;
    }
    /* Enable SPI_FLASH */
    SPIC->ssienr = 1; // What is it for ???
    gd25_gd25_spi_flash_getdr();
}

__attribute__((section(".ram.text"), noinline))
static void gd25_send_command_address(uint8_t cmd, uint32_t addr, uint32_t dum_cycle) {
    /* Disable SPI_FLASH */
    SPIC->ssienr = 0;
    if (dum_cycle != 0) { // spi_flash_set_dummy_cycle(dev, dummy);
        uint32_t cycle = 0;
        /* if using fast_read baud_rate */
        if (((SPIC->ctrlr0) & 0x00100000)) {
            cycle = (SPIC->fbaudr);
        } else {
            cycle = (SPIC->baudr);
        }
        cycle = (cycle * dum_cycle * 2) + DEF_RD_TUNING_DUMMY_CYCLE;
        if (cycle <= 0x10000) {
            DW_BITS_SET_VAL(SPIC->auto_length, bfoSPI_FLASH_AUTO_LEN_DUM, cycle, bfwSPI_FLASH_AUTO_LEN_DUM);
        }
    } else {
        /* Set tuning dummy cycles */
        DW_BITS_SET_VAL(SPIC->auto_length, bfoSPI_FLASH_AUTO_LEN_DUM, DEF_RD_TUNING_DUMMY_CYCLE, bfwSPI_FLASH_AUTO_LEN_DUM);
    }

    /* set ctrlr0: RX mode, data_ch, addr_ch */
    SPIC->ssienr = 0;
    SPIC->ctrlr0 = (SPIC->ctrlr0 | 0x0300);
    SPIC->ctrlr0 = (SPIC->ctrlr0 & 0xfff0ffff);

    /* set flash cmd + addr and write to fifo */
    SPIC->dr[0].word = CMD_ADDR_FORMAT(cmd, addr);
}

__attribute__((section(".ram.text"), noinline))
static void gd25_perform_read_security_registers(uint32_t addr, uint8_t* buf, size_t len) {
    uint32_t dum_cycle = 8;
    uint8_t cmd = 0x48;

    uint32_t ctrl0 = SPIC->ctrlr0;
    uint32_t autoLen = SPIC->auto_length;
    uint32_t addrLen = SPIC->addr_length;
    SCOPE_GUARD({
        SPIC->ctrlr0 = ctrl0;
        SPIC->auto_length = autoLen;
        SPIC->addr_length = addrLen;
    });

    /* setting auto mode CS_H_WR_LEN, address length(3 byte) */
    SPIC->auto_length = ((SPIC->auto_length & 0xfffcffff) | 0x00030000);
    SPIC->addr_length = 3;

    gd25_send_command_address(cmd, addr, dum_cycle);

    uint32_t cnt;
    uint32_t data;
    if (len <= FIFO_SIZE) {
        gd25_enable_cs_read(len);
        cnt = len / 4;
        for (uint32_t i = 0; i < cnt; i++) {
            data = spi_flash_getdr(0, DATA_WORD);
            memcpy(buf, &data, 4);
            buf += 4;
        }
        cnt = len % 4;
        if (cnt > 0) {
            data = spi_flash_getdr(0, DATA_WORD);
            memcpy(buf, &data, cnt);
            buf += cnt;
        }
    } else {
        gd25_enable_cs_read(FIFO_SIZE);
        cnt = FIFO_SIZE / 4;
        for (uint32_t i = 0; i < cnt; i++) {
            data = spi_flash_getdr(0, DATA_WORD);
            memcpy(buf, &data, 4);
            buf += 4;
        }
        /* t is transfer data times,
         * t = (len - first xfer data) / fifo size
         */
        uint32_t t = (len - FIFO_SIZE) / FIFO_SIZE;
        addr = addr + FIFO_SIZE;
        while (t > 0) {
            gd25_send_command_address(cmd, addr, dum_cycle);
            gd25_enable_cs_read(FIFO_SIZE);
            for (uint32_t i = 0; i < cnt; i++) {
                data = spi_flash_getdr(0, DATA_WORD);
                memcpy(buf, &data, 4);
                buf += 4;
            }
            addr = addr + FIFO_SIZE;
            t--;
        }
        uint32_t tmp = len % FIFO_SIZE;
        if (tmp > 0) {
            gd25_send_command_address(cmd, addr, dum_cycle);
            gd25_enable_cs_read(tmp);
            cnt = tmp / 4;
            for (uint32_t i = 0; i < cnt; i++) {
                data = spi_flash_getdr(0, DATA_WORD);
                memcpy(buf, &data, 4);
                buf += 4;
            }
            cnt = tmp % 4;
            if (cnt > 0) {
                data = spi_flash_getdr(0, DATA_WORD);
                memcpy(buf, &data, cnt);
                buf += cnt;
            }
        }
    }
    SPIC->ssienr = 0;
}

__attribute__((section(".ram.text"), noinline))
static int gd25_secure_register_read(uint8_t security_registers_index, uint32_t security_registers_addr, void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < HAL_QSPI_FLASH_OTP_SECTOR_COUNT_GD25, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= HAL_QSPI_FLASH_OTP_SIZE_GD25, SYSTEM_ERROR_INVALID_ARGUMENT);

    uint32_t address = ((security_registers_index + 1) << 12) + security_registers_addr;

    gd25_perform_read_security_registers(address, (uint8_t*)buf, size);
    dcacheCleanInvalidateAligned((uintptr_t)buf, size);

    return SYSTEM_ERROR_NONE;
}

