particle-iot/device-os/hal/src/rtl872x/exflash_hal.cpp
__attribute__((section(".ram.text"), noinline))
static int gd25_secure_register_write(uint8_t security_registers_index, uint32_t security_registers_addr, void* buf, size_t size) {
    CHECK_TRUE(security_registers_index < HAL_QSPI_FLASH_OTP_SECTOR_COUNT_GD25, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(security_registers_addr + size <= HAL_QSPI_FLASH_OTP_SIZE_GD25, SYSTEM_ERROR_INVALID_ARGUMENT);

    uint32_t address = ((security_registers_index + 1) << 12) + security_registers_addr;
    uint8_t addrBuf[3] = {};
    addrBuf[0] = (uint8_t)((address >> 16) & 0xFF);
    addrBuf[1] = (uint8_t)((address >> 8) & 0xFF);
    addrBuf[2] = (uint8_t)((address >> 0) & 0xFF);

    // We may need to improve this
    auto ptr = (uint8_t*)malloc(size + 3);
    if (!ptr) {
        return SYSTEM_ERROR_NO_MEMORY;
    }
    memcpy(ptr, addrBuf, 3);
    memcpy(ptr + 3, buf, size);

    // Write/Erase enable
    FLASH_TxCmd(0x06, 0, nullptr);
    FLASH_WaitBusy(WAIT_WRITE_EN);

    FLASH_TxCmd(0x42, size + 3, ptr);
    FLASH_WaitBusy(WAIT_WRITE_DONE);
    
    // Write/Erase disable
    FLASH_TxCmd(0x04, 0, nullptr);
    return SYSTEM_ERROR_NONE;
}

__attribute__((section(".ram.text"), noinline))
static int gd25_security_register_operation(hal_exflash_gd25_security_register_read_write operation, uintptr_t addr, uint8_t* data_buf, size_t data_size) {
    // Determine which OTP Register to start operating from
    size_t otp_page = addr / HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
    size_t data_to_process = data_size;
    size_t data_processed = 0;
    size_t data_to_process_this_operation = 0;
    int ret = 0;

    while (data_to_process && !ret) {
        // Determine the offset of the current OTP register to start reading/writing from
        size_t register_offset = (addr + data_processed) % HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
        data_to_process_this_operation = data_to_process;

        // If the data remaining to read/write extends into the next register, truncate the read/write amount to fit into this register
        if (register_offset + data_to_process_this_operation > HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25){
            data_to_process_this_operation = HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25 - register_offset;
        }

        ret = operation(otp_page, register_offset, &data_buf[data_processed], data_to_process_this_operation);

        // Increment/decrement counter variables, increment to the next OTP register
        data_to_process -= data_to_process_this_operation;
        data_processed += data_to_process_this_operation;
        otp_page++;
    }

    return ret;
}

__attribute__((section(".ram.text"), noinline))
int hal_exflash_read_special(hal_exflash_special_sector_t sp, uintptr_t addr, uint8_t* data_buf, size_t data_size) {
    ExFlashLock lk(false); // Stop thread scheduler

    CHECK_TRUE(sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(data_buf && data_size > 0, SYSTEM_ERROR_INVALID_ARGUMENT);

    if (flash_init_para.FLASH_Id == FLASH_ID_GD) {
        return gd25_security_register_operation(gd25_secure_register_read, addr, data_buf, data_size);
    } else if (flash_init_para.FLASH_Id == FLASH_ID_MXIC) {
        // Read the first word at 0x00000000
        uint32_t normalContent = 0;
        FLASH_RxData(0, (uint32_t)0, sizeof(normalContent), (uint8_t*)&normalContent);
        {
            SCOPE_GUARD({
                // Just in case, even if it might have failed to enter the secure OTP mode.
                FLASH_TxCmd(MXIC_FLASH_CMD_EXSO, 0, nullptr);
                if (isSecureOtpMode(normalContent)) {
                    SPARK_ASSERT(false);
                }
            });

            FLASH_TxCmd(MXIC_FLASH_CMD_ENSO, 0, nullptr);
            if (isSecureOtpMode(normalContent)) {
                FLASH_RxData(0, (uint32_t)addr, data_size, data_buf);
            } else {
                return SYSTEM_ERROR_INVALID_STATE;
            }
        }
    } else {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    return SYSTEM_ERROR_NONE;
}

__attribute__((section(".ram.text"), noinline))
int hal_exflash_write_special(hal_exflash_special_sector_t sp, uintptr_t addr, const uint8_t* data_buf, size_t data_size) {
    ExFlashLock lk(false); // Stop thread scheduler

    CHECK_TRUE(sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(data_buf && data_size > 0, SYSTEM_ERROR_INVALID_ARGUMENT);

    if (flash_init_para.FLASH_Id == FLASH_ID_GD) {
        return gd25_security_register_operation(gd25_secure_register_write, addr, (uint8_t *)data_buf, data_size);
    } else if (flash_init_para.FLASH_Id == FLASH_ID_MXIC) {
        // Read the first word at 0x00000000
        uint32_t normalContent = 0;
        FLASH_RxData(0, (uint32_t)0, sizeof(normalContent), (uint8_t*)&normalContent);
        {
            SCOPE_GUARD({
                // Just in case, even if it might have failed to enter the secure OTP mode.
                FLASH_TxCmd(MXIC_FLASH_CMD_EXSO, 0, nullptr);
                if (isSecureOtpMode(normalContent)) {
                    SPARK_ASSERT(false);
                }
            });

            FLASH_TxCmd(MXIC_FLASH_CMD_ENSO, 0, nullptr);
            if (isSecureOtpMode(normalContent)) {
                CHECK(hal_flash_common_write(addr, data_buf, data_size, &perform_write, &hal_flash_common_dummy_read));
            } else {
                return SYSTEM_ERROR_INVALID_STATE;
            }
        }
    } else {
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    return SYSTEM_ERROR_NONE;
}

#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER

int hal_exflash_erase_special(hal_exflash_special_sector_t sp, uintptr_t addr, size_t size) {
    if (flash_init_para.FLASH_Id == FLASH_ID_GD) {
        ExFlashLock lk(false); // Stop thread scheduler
        // Write/Erase enable
        FLASH_TxCmd(0x06, 0, nullptr);
        FLASH_WaitBusy(WAIT_WRITE_EN);

        size_t otpPage = addr / HAL_QSPI_FLASH_OTP_SECTOR_SIZE_GD25;
        if (otpPage > 2) {
            return SYSTEM_ERROR_INVALID_ARGUMENT;
        }
        uint32_t address = ((otpPage + 1) << 12);

        // Erase security registers
        uint8_t buf[3] = {};
        buf[0] = (uint8_t)((address >> 16) & 0xFF);
        buf[1] = (uint8_t)((address >> 8) & 0xFF);
        buf[2] = (uint8_t)((address >> 0) & 0xFF);
        FLASH_TxCmd(0x44, sizeof(buf), buf);
        FLASH_WaitBusy(WAIT_WRITE_DONE);
        
        // Write/Erase disable
        FLASH_TxCmd(0x04, 0, nullptr);
    } else {
        /* We only support OTP sector and since it's One Time Programmable, we can't erase it */
    }
    return SYSTEM_ERROR_NOT_SUPPORTED;
}

int hal_exflash_special_command(hal_exflash_special_sector_t sp, hal_exflash_command_t cmd, const uint8_t* data, uint8_t* result, size_t size) {
    ExFlashLock lk;

    uint8_t byte;

    /* General commands */
    if (sp == HAL_EXFLASH_SPECIAL_SECTOR_NONE) {
        if (cmd == HAL_EXFLASH_COMMAND_SLEEP) {
            byte = MXIC_FLASH_CMD_DP;
        } else if (cmd == HAL_EXFLASH_COMMAND_WAKEUP) {
            byte = MXIC_FLASH_CMD_RDID;
        } else if (cmd == HAL_EXFLASH_COMMAND_SUSPEND_PGMERS) {
            byte = MXIC_FLASH_CMD_PGM_ERS_SPD;
        } else if (cmd == HAL_EXFLASH_COMMAND_RESET) {
            byte = MXIC_FLASH_CMD_RSTEN;
        } else {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
        // FIXME: The result of the instruction is not garanteed.
        FLASH_TxCmd(byte, 0, nullptr);
        // For the reset procedure, we need to execute the reset command going forward.
        if (cmd == HAL_EXFLASH_COMMAND_RESET) {
            byte = MXIC_FLASH_CMD_RST;
            // FIXME: The result of the instruction is not garanteed.
            FLASH_TxCmd(byte, 0, nullptr);
        }
    } else if (sp == HAL_EXFLASH_SPECIAL_SECTOR_OTP) {
        if (cmd == HAL_EXFLASH_COMMAND_LOCK_ENTIRE_OTP) {
            byte = MXIC_FLASH_CMD_WREN;
            // FIXME: The result of the instruction is not garanteed.
            FLASH_TxCmd(byte, 0, nullptr);
            byte = MXIC_FLASH_CMD_WRSCUR;
            // FIXME: The result of the instruction is not garanteed.
            FLASH_TxCmd(byte, 0, nullptr);
        } else {
            return SYSTEM_ERROR_NOT_SUPPORTED;
        }
    }

    return SYSTEM_ERROR_NONE;
}

int hal_exflash_sleep(bool sleep, void* reserved) {
    // Note: HAL sleep driver uses SDK API to suspend external flash.
    return SYSTEM_ERROR_NONE;
}

#if MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
extern "C" int hal_exflash_disable_xip(void) {
    ExFlashLock lk;
    XipControl::initXipOff();
    return SYSTEM_ERROR_NONE;
}
#endif // MODULE_FUNCTION != MOD_FUNC_BOOTLOADER
